Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70Q20.xml
        <register caption="Screening Type 2 Register Priority Queue  (index = 0) 6" name="GMAC_ST2RPQ6" offset="0x558" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
          <bitfield caption="Index of Screening Type 2 EtherType register x" mask="0x00000E00" name="I2ETH"/>
          <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x0003E000" name="COMPA"/>
          <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x00F80000" name="COMPB"/>
          <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x3E000000" name="COMPC"/>
          <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
        </register>
        <register caption="Screening Type 2 Register Priority Queue  (index = 0) 7" name="GMAC_ST2RPQ7" offset="0x55C" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
          <bitfield caption="Index of Screening Type 2 EtherType register x" mask="0x00000E00" name="I2ETH"/>
          <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x0003E000" name="COMPA"/>
          <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x00F80000" name="COMPB"/>
          <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x3E000000" name="COMPC"/>
          <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
        </register>
        <register caption="Interrupt Enable Register Priority Queue  (index = 1) 0" name="GMAC_IERPQ0" offset="0x600" rw="W" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Enable Register Priority Queue  (index = 1) 1" name="GMAC_IERPQ1" offset="0x604" rw="W" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Enable Register Priority Queue  (index = 1) 2" name="GMAC_IERPQ2" offset="0x608" rw="W" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Disable Register Priority Queue  (index = 1) 0" name="GMAC_IDRPQ0" offset="0x620" rw="W" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Disable Register Priority Queue  (index = 1) 1" name="GMAC_IDRPQ1" offset="0x624" rw="W" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Disable Register Priority Queue  (index = 1) 2" name="GMAC_IDRPQ2" offset="0x628" rw="W" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Mask Register Priority Queue  (index = 1) 0" name="GMAC_IMRPQ0" offset="0x640" rw="RW" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="AHB Error" mask="0x00000040" name="AHB"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Mask Register Priority Queue  (index = 1) 1" name="GMAC_IMRPQ1" offset="0x644" rw="RW" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="AHB Error" mask="0x00000040" name="AHB"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Mask Register Priority Queue  (index = 1) 2" name="GMAC_IMRPQ2" offset="0x648" rw="RW" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="AHB Error" mask="0x00000040" name="AHB"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Screening Type 2 Ethertype Register  (index = 0) 0" name="GMAC_ST2ER0" offset="0x6E0" rw="RW" size="4">
          <bitfield caption="Ethertype Compare Value" mask="0x0000FFFF" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Ethertype Register  (index = 0) 1" name="GMAC_ST2ER1" offset="0x6E4" rw="RW" size="4">
          <bitfield caption="Ethertype Compare Value" mask="0x0000FFFF" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Ethertype Register  (index = 0) 2" name="GMAC_ST2ER2" offset="0x6E8" rw="RW" size="4">
          <bitfield caption="Ethertype Compare Value" mask="0x0000FFFF" name="COMPVAL"/>
        </register>
