Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70Q20.xml
      <value-group caption="" name="SDRAMC_CFR1__UNAL">
        <value caption="Unaligned access is not supported." name="UNSUPPORTED" value="0"/>
        <value caption="Unaligned access is supported." name="SUPPORTED" value="1"/>
      </value-group>
    </module>
    <module caption="Static Memory Controller" name="SMC" version="6498H">
      <register-group name="SMC">
        <register caption="SMC Setup Register (CS_number = 0)" name="SMC_SETUP0" offset="0x0" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 0)" name="SMC_PULSE0" offset="0x4" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 0)" name="SMC_CYCLE0" offset="0x8" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC MODE Register (CS_number = 0)" name="SMC_MODE0" offset="0xC" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE0__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT" values="SMC_MODE0__BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE0__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
          <bitfield caption="Page Mode Enabled" mask="0x01000000" name="PMEN"/>
          <bitfield caption="Page Size" mask="0x30000000" name="PS" values="SMC_MODE0__PS"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 1)" name="SMC_SETUP1" offset="0x10" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 1)" name="SMC_PULSE1" offset="0x14" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 1)" name="SMC_CYCLE1" offset="0x18" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC MODE Register (CS_number = 1)" name="SMC_MODE1" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE1__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT" values="SMC_MODE1__BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE1__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
          <bitfield caption="Page Mode Enabled" mask="0x01000000" name="PMEN"/>
          <bitfield caption="Page Size" mask="0x30000000" name="PS" values="SMC_MODE1__PS"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 2)" name="SMC_SETUP2" offset="0x20" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 2)" name="SMC_PULSE2" offset="0x24" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 2)" name="SMC_CYCLE2" offset="0x28" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC MODE Register (CS_number = 2)" name="SMC_MODE2" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE2__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT" values="SMC_MODE2__BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE2__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
          <bitfield caption="Page Mode Enabled" mask="0x01000000" name="PMEN"/>
          <bitfield caption="Page Size" mask="0x30000000" name="PS" values="SMC_MODE2__PS"/>
        </register>
